import { Img } from '../../components/SharedLayout/SharedLayout.styled';
import { Container } from './HomePage.styled';

const HomePage = () => {
  return (
    <Container>
      <div>
        <Img src="./src/assets/Rent-A-Car-Web-Banner-12.jpg" alt="rental car" />
      </div>
      <h1>Вітаємо вас в DriveHub!</h1>
      <p>
        Ласкаво просимо до світу найзручнішого та інноваційного сервісу прокату
        авто – DriveHub. <br /> Ми прагнемо забезпечити вас не тільки
        найсучаснішими автомобілями, але й вишуканим досвідом використання
        нашого додатку.
      </p>
      <ul>
        <li>
          🚗 <strong>Розмаїтість Автопарку:</strong> Оберіть автомобіль, який
          відповідає вашим потребам та стилю життя.
        </li>
        <li>
          💻 <strong>Зручний Додаток:</strong> Наш простий та інтуїтивно
          зрозумілий додаток робить прокат авто легким та приємним.
        </li>
        <li>
          💡 <strong>Інноваційні Рішення:</strong> DriveHub використовує
          передові технології, щоб забезпечити вам безпеку та комфорт під час
          кожної поїздки.
        </li>
        <li>
          🌍 <strong>Гнучкі Умови Прокату:</strong> Ми розуміємо ваші потреби,
          тому ми пропонуємо гнучкі умови прокату, щоб ви могли насолоджуватися
          своїми подорожами.
        </li>
      </ul>
      <p>
        Нехай DriveHub стане вашим найкращим партнером у подорожах. Дякуємо за
        вибір нас!
      </p>
      <p>
        З найкращими побажаннями,
        <br />
        Команда DriveHub 🚀
      </p>
    </Container>
  );
};

export default HomePage;
